---
type: FabricRoundingManager
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 9
tags: [revit-api, class]
---

# FabricRoundingManager

`Autodesk.Revit.DB.Structure.FabricRoundingManager` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ApplicableReinforcementRoundingSource | 2014 | `public ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get ; }` |
| Property | ApplicableSegmentLengthRounding | 2017 | `public double ApplicableSegmentLengthRounding { get ; }` |
| Property | ApplicableSegmentLengthRoundingMethod | 2017 | `public RoundingMethod ApplicableSegmentLengthRoundingMethod { get ; }` |
| Property | ApplicableTotalLengthRounding | 2014 | `public double ApplicableTotalLengthRounding { get ; }` |
| Property | ApplicableTotalLengthRoundingMethod | 2016 | `public RoundingMethod ApplicableTotalLengthRoundingMethod { get ; }` |
| Property | SegmentLengthRounding | 2017 | `public double SegmentLengthRounding { get ; set ; }` |
| Property | SegmentLengthRoundingMethod | 2017 | `public RoundingMethod SegmentLengthRoundingMethod { get ; set ; }` |
| Property | TotalLengthRounding | 2014 | `public double TotalLengthRounding { get ; set ; }` |
| Property | TotalLengthRoundingMethod | 2016 | `public RoundingMethod TotalLengthRoundingMethod { get ; set ; }` |